Тест_ЗУП_31_КОРП/src/Catalogs/СменыРаботыСотрудников/СменыРаботыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СменыРаботыСотрудников</name>
  <owners>Catalog.РежимыРаботыСотрудников</owners>
  <tabularSections>
    <name>Расписание</name>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени</name>
      <type>
        <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПереходящиеЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/СменыРаботыСотрудников/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	

#Область СлужебныеПроцедурыИФункции

Функция ИнформацияОРабочемВремениСмен(СписокСмен) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСмен", СписокСмен);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СменыРаботыСотрудниковРасписание.Ссылка КАК Смена,
	|	СменыРаботыСотрудниковРасписание.ВидВремени КАК ВидВремени,
	|	ЛОЖЬ КАК ПереходящаяЧастьСмены,
	|	СменыРаботыСотрудниковРасписание.Часы - СменыРаботыСотрудниковРасписание.ПереходящиеЧасы КАК Часов
	|ИЗ
	|	Справочник.СменыРаботыСотрудников.Расписание КАК СменыРаботыСотрудниковРасписание
	|ГДЕ
	|	СменыРаботыСотрудниковРасписание.Ссылка В(&СписокСмен)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СменыРаботыСотрудниковРасписание.Ссылка,
	|	СменыРаботыСотрудниковРасписание.ВидВремени,
	|	ИСТИНА,
	|	СменыРаботыСотрудниковРасписание.ПереходящиеЧасы
	|ИЗ
	|	Справочник.СменыРаботыСотрудников.Расписание КАК СменыРаботыСотрудниковРасписание
	|ГДЕ
	|	СменыРаботыСотрудниковРасписание.Ссылка В(&СписокСмен)
	|	И СменыРаботыСотрудниковРасписание.ПереходящиеЧасы <> 0";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

#КонецОбласти

#КонецЕсли
